# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhaseArray..::..Append Method
PhaseArray Class See Also
---
Add the phase to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	Phase item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As Phase _
)
```

Visual C++
---
```text
public:
virtual void Append(
	Phase^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PhaseThe phase to be added.
# See Also
PhaseArray Class
Autodesk.Revit.DB Namespace